{"updatedAt":"2025-07-30T22:00:37.170Z","createdAt":"2025-07-30T20:14:46.609Z","id":"Z4YVgig7SHgw5Mg3","name":"tcc","active":false,"isArchived":false,"nodes":[{"parameters":{"resource":"audio","input":"={{ $json.trecho }}","options":{}},"type":"@n8n/n8n-nodes-langchain.openAi","typeVersion":1.8,"position":[208,256],"id":"18120983-f172-4b7f-9a2b-a40465b483f9","name":"Generate audio","credentials":{"openAiApi":{"id":"bEHAhmQV1LUjIUXy","name":"OpenAi account"}}},{"parameters":{"jsCode":"// Obtem o texto da entrada\nconst text = $json[\"Resumo\"];\nconst maxLength = 2000;\n\nfunction splitLongString(text, maxLength) {\n  const result = [];\n  let currentIndex = 0;\n\n  while (currentIndex < text.length) {\n    let chunk = text.slice(currentIndex, currentIndex + maxLength);\n\n    // Evita cortar no meio de palavras\n    if (chunk.length === maxLength) {\n      const lastSpace = chunk.lastIndexOf(' ');\n      if (lastSpace > -1 && currentIndex + maxLength < text.length) {\n        chunk = chunk.slice(0, lastSpace);\n        currentIndex += lastSpace + 1;\n      } else {\n        currentIndex += maxLength;\n      }\n    } else {\n      currentIndex += maxLength;\n    }\n\n    result.push(chunk);\n  }\n\n  return result;\n}\n\nconst splitted = splitLongString(text, maxLength);\n\n// Retorna cada pedaço com índice começando em 1\nreturn splitted.map((part, index) => ({\n  json: {\n    trecho: part,\n    count: index + 1\n  }\n}));\n"},"type":"n8n-nodes-base.code","typeVersion":2,"position":[416,0],"id":"c6697a5e-0a74-4bdd-9ffa-f4f8a1e5da8b","name":"Code"},{"parameters":{"assignments":{"assignments":[{"id":"e9acfb83-848d-45e0-86cc-05b4a82dda36","name":"Resumo","value":"=RESUMO O presente trabalho busca analisar a evolução do marketing ao longo dos tempos, acompanhando as mudanças sociais, econômicas e tecnológicas até a era digital. Com foco no impacto das mídias sociais, a pesquisa explora as mudanças ocorridas na relação entre empresas e consumidores, especialmente diante de um cenário cada vez mais conectado e dinâmico. Para ilustrar essas transformações, foi desenvolvido um estudo de caso com a Doceria Perdomo Doce, um pequeno negócio que encontrou nas redes sociais a oportunidade de expandir sua visibilidade, melhorar o relacionamento com seus clientes e impulsionar suas vendas. O caso da Doceria Perdomo Doce demonstra que, por meio de estratégias simples, como a produção de conteúdo, o relacionamento direto nas redes e a valorização da experiência do cliente, é possível construir uma marca forte e conquistar um espaço relevante no mercado. Conclui-se que, na atualidade, não basta oferecer um bom produto, torna-se essencial criar conexão, gerar valor e estar presente onde o consumidor está: no meio digital. As empresas que entendem essa lógica e utilizam as mídias sociais de forma inteligente e ética têm maiores chances de crescer de forma sustentável, adaptando-se às exigências de um mundo em constante transformação. Palavras-chave: Marketing Digital. Mídias Sociais. Empreendedorismo. Comunicação do consumidor. Pequenos negócios.  1 INTRODUÇÃO O marketing é uma área do conhecimento que sempre esteve presente nas relações humanas, desde os tempos mais remotos, quando as trocas comerciais eram realizadas de forma rudimentar. Com isto, ao longo dos séculos, essa prática se desenvolveu tornando-se uma ciência estratégica indispensável para a sobrevivência e o crescimento das organizações. Inicialmente, voltado apenas para a venda de produtos, o marketing evoluiu passando a compreender profundamente os desejos, as necessidades e os comportamentos dos consumidores. Essa evolução reflete não apenas as transformações tecnológicas, mas também as mudanças culturais, econômicas e sociais que moldaram o mundo contemporâneo. Durante o século XX, especialmente após a Revolução Industrial, o marketing começou a se estruturar de maneira mais organizada. As empresas perceberam que não bastava produzir em larga escala, era necessário também criar estratégias que aproximassem os produtos dos consumidores. O surgimento dos meios de comunicação de massa, como rádio, televisão e jornais, proporcionou novas formas de divulgação e relacionamento com o público. No entanto, esse modelo era predominantemente unidirecional, onde a empresa comunicava e o consumidor apenas recebia a informação, sem possibilidade de interação direta. Com o avanço da tecnologia e, principalmente, com a popularização da internet a partir de 1990, o marketing enfrentou uma das suas maiores revoluções. O cenário digital trouxe uma nova dinâmica para o mercado, permitindo que as empresas se comuniquem com seus públicos de maneira mais rápida, segmentada e eficiente. As mídias sociais, que surgiram no início dos anos 2000, consolidaram ainda mais essa renovação, possibilitando uma comunicação bidirecional, na qual consumidores passaram a participar ativamente do processo, opinando, avaliando e até cocriando junto às marcas. Essa nova realidade exigiu que as empresas repensassem suas estratégias, deixando de focar exclusivamente no produto e passando a priorizar o cliente, suas experiências e seu nível de satisfação. No ambiente digital, as marcas precisam ser mais humanas, transparentes e autênticas, uma vez que qualquer erro pode se tornar viral, impactando diretamente sua reputação. Dentro desse contexto, o presente Trabalho de Conclusão de Curso (TCC) tem como objetivo analisar a evolução do marketing até a era digital, destacando seu impacto nas mídias sociais e, especialmente, como essas transformações influenciam diretamente os pequenos negócios. Para isso, foi desenvolvido um estudo de caso na Doceria Perdomo Doce, uma empresa de pequeno porte que, assim como muitas outras, precisou se adaptar as exigências  do mercado digital para manter-se competitiva, conquistar novos clientes e fortalecer sua marca. O estudo busca compreender como a Doceria Perdomo utilizou as ferramentas digitais, e as redes sociais, para aumentar sua visibilidade, atrair clientes e promover seus produtos. Para alcançar esses objetivos, este trabalho foi estruturado em três tópicos principais: ● O primeiro aborda a trajetória histórica do marketing, suas transformações e os principais marcos até a consolidação do marketing digital. ● O segundo discute o papel das mídias sociais na atualidade, seus impactos na comunicação, no comportamento dos consumidores e na gestão empresarial. ● Por fim, o terceiro apresenta uma análise sobre o empreendedorismo na era digital, destacando as diferenças em relação ao modelo tradicional, bem como os desafios e as oportunidades que surgem para os empreendedores nesse novo cenário.,  Dessa forma, esta pesquisa pretende não apenas contribuir para a compreensão das mudanças ocorridas no campo do marketing, mas também oferecer uma reflexão sobre como as pequenas empresas podem se beneficiar das tecnologias digitais, utilizando as mídias sociais como ferramentas estratégicas para o crescimento sustentável, a construção de marca e a fidelização dos clientes.  2 METODOLOGIA A metodologia adotada foi de caráter qualitativo, fundamentada em pesquisa bibliográfica e na análise de práticas de marketing digital aplicadas pela empresa estudada. O trabalho também aborda como as mídias sociais alteraram a dinâmica de consumo. Ao longo da pesquisa, ficou evidente que o marketing digital, quando bem aplicado, permite que empresas pequenas alcancem resultados expressivos, sem depender dos altos custos da mídia tradicional.  3 REFERENCIAL TEÓRICO 3.1 A EVOLUÇÃO DO MARKETING E SUA HISTÓRIA O marketing, como o conhecemos hoje, passou por um longo processo de transformação, acompanhando o desenvolvimento econômico, social e tecnológico das sociedades. Com origens que lembram os tempos antigos, a história do marketing mostra uma constante adaptação às necessidades humanas e as mudanças nos mercados. Desde os primeiros passos comerciais, mesmo antes da ideia do marketing, já era possível identificar estratégias básicas para atrair consumidores. Como afirma Las Casas (2009, p. 25):  O marketing surgiu com o homem, no momento em que ele começou a realizar trocas. Mesmo sem consciência, já praticava atividades relacionadas ao marketing, como buscar atender as necessidades dos outros em troca de algo que lhe fosse útil. Ou seja, ainda que de forma primitiva, as bases do marketing estavam presentes nas trocas realizadas nas feiras e mercados das civilizações antigas. A atividade consiste em identificar e satisfazer necessidades humanas e sociais, podendo assumir uma perspectiva voltada para o bem-estar coletivo, ao buscar oferecer um padrão de vida melhor ao consumidor. Trata-se de um processo social no qual indivíduos e grupos atendem seus desejos e carências por meio da criação, oferta e troca voluntária de produtos e serviços que tenham valor para ambas as partes. Com o surgimento do marketing por volta da década de 1950, o foco principal das empresas era a venda em si. Pouco se considerava a opinião dos consumidores, que não participavam do processo de desenvolvimento dos produtos nem tinham espaço para expressar seus gostos e necessidades. No entanto, com as modificações provocadas pela Revolução Industrial e, especialmente, com a chegada da Internet, houve mudanças significativas. O consumidor passou a ser visto como parte central da estratégia das empresas, como bem define Kotler: O Marketing surgiu em meados da década de 1950. Vem de uma filosofia de fazer-e-vender, voltada para o produto, passamos para uma filosofia de sentir-e-responder, centrada no cliente. Em vez de caçar, o Marketing passa a plantar (2017, p.14).  A atividade de promover produtos ou serviços dentro das empresas tem como principal objetivo despertar o interesse do público e criar valor para ele. Isso envolve compreender as necessidades dos consumidores e, a partir disso, gerar resultados positivos no ambiente empresarial. Para alcançar esses objetivos, utiliza-se um conjunto de estratégias  voltadas à satisfação do cliente, buscando atender suas expectativas e desejos. Quando abordamos esse campo, é comum associá-lo a áreas como vendas, propaganda, comunicação, atendimento e pré-venda, todas fundamentais para aproximar o consumidor da marca. Com defini Las Casas (2012, p. 27):  O marketing surgiu da necessidade das empresas se diferenciarem num cenário de crescente industrialização e competição. Com o aumento da produção em massa, tornou-se fundamental atrair a atenção do consumidor e compreender suas necessidades.  A grande mudança neste cenário ocorreu durante a Revolução Industrial. Antes dela, os produtos eram fabricados manualmente, o que demandava tempo e limitava a oferta. Com a industrialização, tornou-se possível produzir em grande escala, o que aumentou a concorrência e a oferta no mercado. Nesse novo contexto, surgiu a necessidade de divulgar as marcas de forma mais eficiente, alcançando o público com mais rapidez e evitando estoques parados. Assim, consolidou-se a importância do marketing como uma ferramenta essencial na relação entre empresas e consumidores.  3.1.1 Planejamento de Marketing O planejamento é uma das funções mais importantes na administração e na gestão estratégica. Auxiliando no direcionamento e organização para atingir os objetivos, definir metas de pequeno, médio e longo prazo, e permitir tomadas de decisões de forma mais segura e eficiente. Entender os diferentes tipos de planejamento é importante para alinhar as estratégias, aproveitar melhor os recursos e prever acontecimentos futuros. De acordo com Chiavenato (2004) planejar e decidir antecipadamente o que fazer, de que maneira fazer, quando fazer e quem deve fazer. Ou seja, o planejamento é um método que contribui para prever cenários e organizar ações, com o objetivo de reduzir falhas e alinhar os esforços de uma equipe ou organização em torno de um propósito comum. Ele permite uma visão mais clara dos caminhos a seguir e ajuda na tomada de decisões mais assertivas. Dentro dessa lógica, podemos identificar três níveis principais: o planejamento estratégico (que define as metas de longo prazo e a direção da empresa), o planejamento tático (que transforma essas metas em ações mais específicas por área ou departamento) e o planejamento operacional (que se concentra nas tarefas do dia a dia, garantindo a execução pratica do que foi definido nos níveis anteriores).  Quando falamos do ambiente de mercado, também é possível aplicar esses conceitos ao contexto mercadológico. Neste caso, existem dois tipos fundamentais: o planejamento estratégico de marketing (voltado para decisões amplas de longo prazo) e o planejamento tático de marketing (que foca nas ações e campanhas específicas). Ambos são aplicados por meio do chamado marketing administrativo, que busca garantir que as estratégias estejam alinhadas com os objetivos da organização. Como reforça Cobra (2010, p. 38) “o planejamento de marketing é essencial para garantir a competitividade da empresa no mercado. Ele permite uma visão de futuro e orienta as ações de forma integrada”. O processo de planejamento requer a elaboração de um plano de ação, bem como a dedicação de tempo para refletir sobre os eventos em curso e as possíveis situações futuras, planejar acordos, e conciliar parcerias. As metas devem ser comunicadas a todos os envolvidos, a fim de promover um processo organizacional positivo e em constante evolução. Metas não alcançadas devem ser reavaliadas, corrigidas e realinhadas por meio de estratégias de marketing administrativo. Na prática, esse processo segue uma lógica bem definida. Inicia-se com a análise de oportunidades no mercado, transita pela escolha do público-alvo, a criação de estratégias, no desenvolvimento de ações concretas e finaliza-se com o acompanhamento de todos os esforços realizados. Durante o planejamento, é essencial estabelecer estratégias eficazes que estejam alinhadas aos objetivos da empresa, estas decisões devem ser bem estruturadas, claras e objetivas, garantindo que os resultados sejam alcançados com consistência e impacto direto no público desejado. Como destaca Kotler:  Marketing é uma ferramenta indispensável para estudar os desejos e o comportamento do consumidor, assim como o tamanho real e potencial do mercado. Uma parte importante da coleta de informações sobre o ambiente e a mensuração do potencial de marketing e a previsão da demanda futura. Para transformar a estratégia de marketing em programas de marketing, os gerentes de marketing precisam tomar decisões básicas sobre gastos, atividades e alocação de marketing (2017, p. 36). Entender os interesses do consumidor, e o seu comportamento diante das opções disponíveis no mercado, é essencial para as empresas que buscam se manter competitivas. Essa análise não se limita apenas às demandas atuais do seu público, incorpora também a identificação de seus desejos futuros, considerando o potencial de crescimento e as mudanças nos hábitos de consumo. Para tanto, é indispensável reunir informações sobre o ambiente em que a organização está inserida. Avaliar a expansão atual e o potencial de um mercado contribui para projetar demandas futuras, identificar oportunidades e agir de forma mais estratégica. Essa coleta de  dados se torna um pilar na tomada de decisões conscientes e bem fundamentadas.  3.1.2 A Evolução do Marketing na Era Digital O advento da era digital modificou a forma como as empresas e os consumidores se relacionam. Com o crescimento da internet, o aparecimento das redes sociais e o fácil acesso a informação, o marketing ganhou novas ferramentas e maneiras de se comunicar, tornando- se mais interativo, personalizado e focado no consumidor. Diferente das formas tradicionais, que tinham como base uma comunicação direta, o marketing digital permite uma troca de informações, onde o público também cria conteúdo, emite opiniões, compartilha e influencia outros consumidores. Como afirma Kotler et al. (2017, p. 31):  O marketing 4.0 marca a transição do marketing tradicional para o digital. Ele combina a interação online e offline, conectando os consumidores não só com as marcas, mas também entre si. Nesse ambiente, as decisões de compra são muito influenciadas pelas comunidades digitais e pelas experiências compartilhadas. Essa troca de ideias e valor mudou o papel das marcas, que precisam se posicionar de forma transparente, humana e engajada. As empresas não falam mais para o consumidor, mas com ele, em um processo constante de troca de opiniões, ideias e sentimentos. Outro fator importante é o impacto das redes sociais, que se tornaram grandes espaços que apresentam o comportamento e opinião do consumidor. Aplicativos como Instagram, Facebook, YouTube e TikTok contribuem para formar tendências, criar comunidades e influenciar as decisões de compra em tempo real. Como destaca Torres (2010, p. 45) “as redes sociais deram voz ao consumidor como nunca antes. O poder de influência foi descentralizado, e agora qualquer pessoa pode se tornar referência, criar conteúdo relevante e impactar milhares de outros consumidores”. Nesse novo cenário, o marketing digital vai além da simples venda, envolve a construção de marca, posicionamento, relacionamento, propósito e experiência. As empresas que compreendem as mudanças digitais e de mercado conseguem se adaptar melhor às necessidades de um público cada vez mais conectado, crítico e consciente. Portanto, o marketing na era digital exige uma nova forma de pensar. Não é apenas sobre estar presente nas plataformas digitais, mas sobre entender como esse ambiente funciona, conversar com sinceridade e gerar conexão para o consumidor. Com a chegada da tecnologia, torna-se necessário a mudança de atitudes dos fornecedores, pois os clientes estão buscando informações de forma constante e, com a tecnologia acessível, cada vez mais é preciso buscar novas formas de atrair clientes e fidelizá-los.  O marketing digital transformou significativamente a maneira como os consumidores pensam e buscam por produtos que atendam às suas necessidades. Diante dessa mudança, as empresas passaram a adaptar e aprimorar suas estratégias com o objetivo de atrair e engajar seus clientes de forma mais eficaz. Sendo assim:  As tecnologias digitais nos forçam a pensar de maneira diferente sobre como compreendermos e criamos valor para o cliente, o que os clientes valorizam pode mudar com muita rapidez, e nossos concorrentes estão a toda hora mudando, descobrindo novas oportunidades que talvez sejam valorizadas pelos clientes”. (Rogers, 2023, p.19).  Anteriormente as empresas utilizavam os meios de comunicação como rádios, jornais e revistas para divulgarem seus produtos. Após a expansão da internet, o marketing começou a seguir um novo caminho, iniciando-se a nova Era Digital. Pequenas empresas passaram a utilizar canais de pesquisa para alcançar seu público de interesse de forma mais eficiente, aquilo que antes levava mais tempo para despertar o interesse do consumidor, com as plataformas online, passou a acontecer de maneira muito mais rápida. Pessoas do mundo todo passaram a se conectar em tempo real, com novas plataformas digitais, muitos influenciadores atraem milhares de seguidores e, com isso, despertando o interesse do público a fecharam contratos com grandes marcas. O aumento dos celulares smartphones e das mídias digitais procedeu para que o marketing se tornasse mais rápido, claro e atrativo, facilitando o acesso às informações e estimulando o poder de compra do consumidor.  3. 2 O QUE SÃO MÍDIAS SOCIAIS As mídias sociais se tornam uma parte importante no dia a dia das pessoas e das estratégias de comunicação das empresas. Mais do que simples canais de interação, se tornaram um meio propagar a comunicação, informações, opiniões, sugestões, ideias e experiências, o qual os valores são compartilhados em tempo real, moldando comportamentos e influenciando decisões. De forma geral, as mídias sociais podem ser entendidas como plataformas digitais que visam a criação e o compartilhamento de conteúdo por parte dos usuários. Elas são diferentes do modelo de comunicação tradicional e centralizado, abrindo espaço a um local dinâmico e colaborativo. Segundo Recuero (2014, p. 34):  As mídias sociais são espaços mediados por tecnologias digitais onde se dá a construção de redes sociais por meio da interação, da produção de conteúdo e da  manutenção de laços sociais. Elas envolvem tanto as plataformas quanto os discursos e práticas construídos a partir delas.  Esse conceito mostra que as mídias sociais vão além das ferramentas, também incluem os modos de uso, os significados ditos pelos usuários e as mudanças sociais que se formam nesses ambientes. Cada plataforma como Facebook, Instagram, X (antigo Twitter), YouTube, TikTok e LinkedIn possui suas próprias características, formatos e públicos, mas todas compartilham interatividade. Com isso as empresas começaram a alterar suas estratégias na parte digital. Nas redes sociais, o controle não estão exclusivamente nas mãos das empresas. O público participa ativamente da construção de imagens, avaliando produtos, comentando experiências e viralizando conteúdo. Torres (2010, p. 39) explica que “nas mídias sociais, o consumidor deixa de ser apenas receptor da comunicação. Ele passa a produzir conteúdo, avaliar, comentar, criticar e influenciar outros consumidores. O poder se desloca e se redistribui”. Por este motivo, o uso estratégico das redes sociais exige autenticidade, escuta ativa e construção de relacionamento. Empresas que conseguem conversar de maneira transparente e oferecer conteúdo relevante se destacam e ganham a confiança do público. Para além de uma tendência, as redes sociais são hoje um espaço fundamental de interação, pertencimento e construção de imagem. Elas, juntamente com outros canais de comunicação como sites, aplicativos e e-mails, oferecem às empresas meios eficazes para interagir com seus clientes, promovendo um relacionamento mais próximo e personalizado com o consumidor, muitos de uma forma orgânica, e não tendo gasto algum com as divulgações dos produtos.  3.2.1 Quais são os impactos causados pelas mídias sociais As redes sociais provocaram mudanças na maneira como as pessoas se comunicam, consomem, interagem e até se posicionam no mundo. Seu impacto ultrapassa o espaço da tecnologia, influenciando aspectos culturais, sociais, psicológicos e econômicos. Essas plataformas digitais passaram a desempenhar um papel ativo na construção de identidades, na divulgação de informações e na formação de opinião. No aspecto organizacional do marketing, as redes sociais mudaram de forma significativa o sentido da comunicação com o público. O consumidor deixou de ser passivo e assumiu o papel de protagonista nas relações com as marcas. Segundo Torres (2010, p. 61) “as mídias sociais representam uma mudança fundamental no relacionamento entre empresas e consumidores. A comunicação deixou de ser unilateral para se tornar interativa, onde o  consumidor tem voz ativa, opina, questiona e influencia”. Esse novo comportamento exige das organizações uma postura mais transparente, humana e responsiva. Ao mesmo tempo, cria uma oportunidade única de aproximação, engajamento e fidelização, desde que bem gerida. O relacionamento, antes resumido em campanhas e anúncios, agora se baseia na construção de diálogo e confiança. Além disso, nas redes sociais houve uma mudança no modo como as informações são produzidas e compartilhadas. A velocidade e a quantidade de conteúdo gerado por usuários possuem efeitos diretos nas opiniões públicas e até em processos políticos, econômicos e sociais. Castells (2009, p. 147) observa que “vivemos em uma sociedade em rede, na qual os fluxos de informação acontecem em tempo real, sem controle centralizado, permitindo que qualquer indivíduo com acesso à internet se torne produtor e difusor de conteúdo”. Do ponto de vista psicológico, os impactos também são notáveis. O uso excessivo de redes sociais podem gerar ansiedade, dependência emocional, comparação constante e sensação de insuficiência, pois as redes sociais englobam um ambiente que combina exposição, invisibilidade, conexão, solidão, pertencimento e exclusão. Apesar desses desafios, torna-se inviável negar que as mídias sociais criaram novas formas de expressão, empoderamento e mobilização coletiva. Elas permitiram o surgimento de movimentos sociais, deram voz a minorias e fortaleceram causas importantes. Tudo remete que seu impacto é indefinido: ao mesmo tempo em que aproxima e empodera, pode também causar desinformação e fragilizar. Contudo, deve se ter um olhar crítico para compreender os impactos que as redes sociais podem causar. Trata-se de um fenômeno que continua em transformação, desafiando constantemente a forma como nos relacionamos com o mundo e com nós mesmos. Segundo Recuero (2014, p. 92) “as mídias sociais favorecem a construção de bolhas informacionais e a replicação de discursos homogêneos. Isso impacta diretamente a percepção de mundo dos usuários, que passam a conviver apenas com opiniões semelhantes às suas”. As mídias sociais transformaram a sociedade, trazendo impactos positivos e negativos. No início, novas tecnologias despertam grande interesse, mas com o tempo tornam-se parte do cotidiano. A chegada da internet eliminou barreiras de distância e tornou o acesso à informação essencial, ajudando a evitar manipulações e mantendo as pessoas atualizadas em tempo real. Estas tecnologias permitem cruzar dados e compartilhar informações de diversas áreas, como saúde e mercado de trabalho. As redes sociais também passaram a ser ferramentas de mobilização social, permitindo  que pessoas se unam por causas políticas e sociais, além de manterem contato com familiares e amigos à distância. Pequenos empreendedores encontraram nessas plataformas uma forma acessível de divulgar produtos e serviços com baixo custo. Entretanto, com a exposição constante a padrões irreais de beleza e sucesso, muitas vezes mostrados nas redes, pode afetar a autoestima e a saúde mental, gerando ansiedade e depressão, principalmente entre adolescentes e jovens. A comparação com essas vidas \"perfeitas\" acaba impactando negativamente a percepção sobre si mesmo. Além disso, o uso excessivo das mídias sociais pode prejudicar a produtividade, diminuir o convívio social e favorecer a disseminação de notícias falsas. A busca por engajamento muitas vezes leva a propagação de conteúdos distorcidos, intensificando os efeitos negativos desse ambiente tão presente na rotina das pessoas.  3.3 EMPREENDEDORISMO Os primeiros indícios de empreendedorismo ocorreram no século XVII, período em que os empreendedores firmavam contratos com o governo para a prestação de serviços que foram sendo gradualmente definidos. Com o início da industrialização, tornou-se encarar a inovação de maneiras totalmente diferentes com novas ideias, conforme afirma: Rogers (2023, p. 30) “para inovar na era digital é preciso executar com realismo tanto experimentos convergentes (como amostras válidas, grupos de teste e controles) quantos experimentos divergentes (concebidos para pesquisas abertas)”. O empreendedorismo sempre esteve presente na história das pessoas, desde as primeiras trocas entre as antigas civilizações até os negócios digitais de hoje, que crescem muito rápido. A ideia principal do empreendedorismo é de perceber oportunidades e criar soluções permanentes, mas a maneira como isso acontece mudou bastante com o avanço da tecnologia e o uso cada vez maior da internet e dos meios digitais. Na ideia clássica, o empreendedor era visto como alguém que assumia riscos em busca de lucros ao explorar lacunas do mercado. Segundo Dornelas (2008, p. 17) “empreendedor é aquele que identifica oportunidades e transforma ideias em negócios lucrativos. E o agente de mudanças que cria soluções inovadoras para atender as demandas da sociedade”. Com o passar dos tempos, o empreendedorismo esteve conectado a atividades presenciais, com lojas físicas, estoques, e processos produtivos tradicionais. Era preciso fazer investimentos de capital, contratar mão de obra, lidar com fornecedores e enfrentar os desafios geográficos e logísticos. Esse modelo, que ainda permanece em uso em muitos  setores, exigia mais recursos e tempo para se tornar importante no mercado. Diferente do modelo tradicional, o empreendedorismo digital não depende de lojas físicas montadas. É possível abrir um negócio com um dispositivo móvel, conexão à internet e uma boa ideia de projeto. O ambiente digital permite testes rápidos, interação constante com o público e crescimento flexível. Startups, e-commerces, influenciadores digitais e criadores de conteúdo são exemplos presentes neste novo perfil empreendedor. Outro ponto que torna diferente o empreendedorismo da era digital, é a capacidade de atingir mercados globais com baixo custo. Como destaca Ries (2012, p. 34) “o empreendedor moderno constroi negócios em ambientes de extrema incerteza, mas ao mesmo tempo com ferramentas poderosas que permitem aprender com o cliente em tempo real e adaptar-se rapidamente”. No entanto, vale lembrar que, apesar de mais acessível, o empreendedorismo digital também encontra novos desafios, como a alta competitividade, a necessidade constante de atualização e a dificuldade de se destacar em meio a tantas informações. Portanto, ao comparar o empreendedorismo tradicional com o digital, observa-se uma mudança significativa nas ferramentas, nos processos e nos comportamentos. O não se tornar imutável é a essência empreendedora, a coragem de inovar, de correr riscos e de transformar ideias em realidades que gerem valor e cure a dor dos consumidores. Com a chegada da Era Digital a tecnologia não passa a ser somente exclusividade dos ricos, o rápido avanço tecnológico, aliado à produção em larga escala, à ampla comercialização e à competitividade nos preços, tornou os recursos tecnológicos mais acessíveis à população em geral. Empresários que precisavam viajar para um determinado lugar para fazer uma reunião de negócios, hoje pode ser resolvido com uma simples conferência através de videochamada. Uma ligação para determinadas empresas via telefone, causavam transtornos plea demora e atendimentos congestionados, ocasionando a desistência do atendimento. Com os novos canais de comunicação, as empresas facilitaram o tempo do cliente através mídias sociais, whatsapp automatizados, ligações automáticas conversando com o cliente em tempo real, gerando satisfação ao consumidor. Para Logo “tudo que era grátis está ficando pago e tudo que era pago, está ficando grátis”(2019, p 146). O autor destaca que antes pagamos por jornais e tínhamos a transmissão de tv de graça, agora por tv por assinatura e temos revistas e jornais de graça (Logo, 2019). O smartphone começou a existir a partir de 2007, quando a empresa Iphone de fato lançou essa variedade de aparelhos móveis, em sete anos após seu lançamento, conseguiu alcançar e ultrapassar o primeiro bilhão de aparelhos, enquanto a tv por exemplo, levou mais de 60 anos  para conseguir atingir os mesmos números. Nesse cenário, no qual os acontecimentos ocorrem de forma cada vez mais rápida, é crucial que o marketing ganhe ritmo para acompanhar o mundo conectado no futuro.  4 ESTUDO DE CASO PERDOMO DOCES – SUPERAÇÃO, EMPREENDEDORISMO, CRISE E REPOSICIONAMENTO DE MARCA  O estudo de caso tem como objetivo apresentar a trajetória de sucesso da empresa Perdomo Doces, anteriormente conhecida como Mariana Perdomo Doceria. Fundada por Mariana Perdomo, a marca tornou-se referência no segmento de confeitaria no estado de Goiás, expandindo sua atuação para outras regiões do Brasil. A história da empresa envolve características da gestão empreendedora moderna: superação, inovação, marketing digital, gestão de crise e branding. A Perdomo Doces iniciou suas atividades em 2015, quando Mariana, recém-formada em Gastronomia, decidiu empreender vendendo bolos de pote em feiras gastronômicas de Goiânia. Utilizando a cozinha de sua residência como centro de produção e enfrentando limitações financeiras, Mariana conseguiu vender todas as 220 unidades preparadas para seu primeiro evento, demonstrando a aceitação imediata do público (Empreender em Goiás, 2023). A partir dessa experiência, abriu sua primeira loja física no Setor Bueno, em Goiânia, marcando o início de uma trajetória de crescimento consistente. Com a expansão do negócio, novas unidades foram abertas em cidades como Anápolis e Brasília. A marca também investiu em inovação digital, com o lançamento de um aplicativo próprio, drive-thru e serviços de delivery. A comunicação da empresa, especialmente no Instagram, baseia-se em afetividade, memória afetiva e experiência do consumidor — elementos centrais na construção de valor de marca, segundo Kotler e Keller (2012). Em 2019, a empresa inovou ao lançar seu primeiro drive-thru, oferecendo praticidade ao cliente e demonstrando capacidade de adaptação às mudanças no comportamento do consumidor. Essa inovação foi fundamental durante a pandemia da COVID-19, garantindo a continuidade das operações e reforçando o posicionamento da marca como moderna e atenta às necessidades do público. Contudo, em 2023, a Perdomo Doces enfrentou uma crise de grandes proporções, quando um cliente, policial penal, faleceu após consumir um produto da empresa (Braga, 2023). A marca foi envolvida em suspeitas de envenenamento, o que resultou em forte repercussão negativa nas redes sociais e na imprensa. Fake news e julgamentos precipitados comprometeram a reputação da empresa, colocando em risco tudo o que havia sido construído até então. A empresária Mariana Perdomo respondeu à crise com responsabilidade e transparência. Recolheu voluntariamente os lotes suspeitos, colaborou com a polícia, reforçou  os protocolos de segurança alimentar e comunicou-se com clareza e empatia por meio das redes sociais. Após análises do Procon, não foram encontradas irregularidades nos produtos (Braga, 2023). Apesar de um prejuízo estimado em R$300 mil, a empresária reforçou sua fé, coragem e resiliência — características destacadas por Chiavenato (2005) como essenciais à liderança empreendedora em tempos de adversidade. O episódio evidenciou o poder ambivalente das mídias sociais: ao mesmo tempo em que são ferramentas de divulgação e conexão com o público, também podem se tornar canais de propagação de boatos e desinformação. Diante disso, Mariana Perdomo redesenhou a estratégia de comunicação digital da empresa, tornando-a mais humanizada, próxima e baseada na confiança. A nova abordagem incluiu bastidores da produção, vídeos com os colaboradores e lives com a fundadora, criando um canal de escuta ativa com os consumidores. Além disso, em 2022, a empresa passou por um processo de rebranding, alterando seu nome de “Mariana Perdomo Doceria” para Perdomo Doces. A mudança tinha como objetivo desvincular a imagem da empresa exclusivamente da figura da fundadora, ampliando o conceito da marca como coletivo. Segundo Mariana, “era o momento de expressar essas transformações”, reconhecendo a importância da equipe e da evolução do negócio (Faria, 2022). O rebranding também reposicionou a marca no mercado como um ecossistema de experiências afetivas, indo além da venda de doces. A diversificação do cardápio inclui bolos de pote, gelatos, tortas, doces individuais, biscoitos, produtos sem açúcar, cafés e combos afetivos. Os preços variam entre R$8,00 e R$250,00, permitindo atender a diferentes perfis de consumidores. Em 2024, a empresa inaugurou a Casa Perdomo, espaço voltado para eventos e experiências sensoriais, reforçando o compromisso da marca com o “marketing de experiência”, conceito central em Schmitt (1999), que enfatiza a importância de criar vivências memoráveis para os consumidores. A gestão de crise vivenciada pela Perdomo Doces é um exemplo real e atual da importância da comunicação transparente, da liderança resiliente e do posicionamento coerente da marca. Ries e Trout (2004) defendem que o posicionamento é a batalha travada na mente do consumidor. Nesse sentido, a Perdomo Doces conseguiu preservar sua imagem e reconstruir laços com o público por meio de autenticidade e coerência com seus valores.  5 CONCLUSÃO Torna-se claro como o marketing passou por uma grande transformação ao longo dos anos. Deixa-se de ser somente uma forma de venda e passa a ser uma maneira de se conectar com as pessoas, compreender suas necessidades e criar experiências que fazem sentido. A internet e as redes sociais alteraram o modo operacional: hoje quem manda é o consumidor. As marcas precisam aprender e inovar no contato com ele, criar uma conexão, humanizando e gerando campanhas que os consumidores se sentem parte da empresa, as histórias refletem o que eles vivem no dia a dia, se exemplifica nas campanhas como dia das mães, natal dentre outras. A história da Perdomo Doces demonstra que o sucesso de uma marca vai muito além da qualidade do produto. Envolve a construção de vínculos afetivos com o consumidor, a capacidade de inovar, a habilidade de gerir crises com empatia e a presença estratégica nas mídias digitais. O estudo de caso confirma a relevância de um marketing voltado para o relacionamento e a experiência, alinhado com as necessidades emocionais do consumidor contemporâneo. A trajetória da empresa também evidencia a importância da escuta ativa, da humanização da comunicação e da responsabilidade social. Ao transformar uma crise em uma oportunidade de fortalecimento da marca, a Perdomo Doces revela a força do empreendedorismo feminino no Brasil e serve como inspiração para empresas que desejam crescer com propósito, autenticidade e inovação. Conclui-se que, mais do que oferecer um bom produto ou utilizar técnicas complexas, é fundamental estabelecer um bom relacionamento com o público, gerar valor genuíno e manter um diálogo constante e aberto. Neste sentido, o marketing, principalmente o digital, faz toda a diferença no sucesso organizacional. O exemplo da Perdomo Doces mostrou que, mesmo sendo uma empresa pequena e em ascensão, é possível crescer e se destacar usando o marketing digital de forma inteligente. A trajetória da marca é inspiradora, pois demonstra que por meio da criatividade, coragem e uma boa comunicação, é possível superar até os momentos mais difíceis e diversos.","type":"string"}]},"options":{}},"type":"n8n-nodes-base.set","typeVersion":3.4,"position":[208,0],"id":"8fe701b9-41c2-4554-9af1-e2a494eea4af","name":"Edit Fields"},{"parameters":{"options":{}},"type":"n8n-nodes-base.splitInBatches","typeVersion":3,"position":[624,0],"id":"0c25ce05-38fa-4b0f-a7e2-394a67e93d5a","name":"Loop Over Items"},{"parameters":{"name":"=audio{{ $('Loop Over Items').item.json.count }}.mp3","driveId":{"__rl":true,"mode":"list","value":"My Drive"},"folderId":{"__rl":true,"value":"1Usl7qSHdMFhXz27JaLAN1mIIib7uv4X2","mode":"list","cachedResultName":"Audios tcc","cachedResultUrl":"https://drive.google.com/drive/folders/1Usl7qSHdMFhXz27JaLAN1mIIib7uv4X2"},"options":{}},"type":"n8n-nodes-base.googleDrive","typeVersion":3,"position":[432,256],"id":"65b93a5f-3f10-4e57-93e6-d6da79216558","name":"Upload file","credentials":{"googleDriveOAuth2Api":{"id":"UMUzXd6peuAPf6IA","name":"Google Drive account"}}},{"parameters":{"resource":"audio","input":"={{ $json.trecho }}","options":{}},"type":"@n8n/n8n-nodes-langchain.openAi","typeVersion":1.8,"position":[208,832],"id":"ff3dd327-9dde-47d1-9c73-6bdac4866897","name":"Generate audio1","credentials":{"openAiApi":{"id":"bEHAhmQV1LUjIUXy","name":"OpenAi account"}}},{"parameters":{"jsCode":"// Obtem o texto da entrada\nconst text = $json[\"Resumo\"];\nconst maxLength = 3000;\n\nfunction splitLongString(text, maxLength) {\n  const result = [];\n  let currentIndex = 0;\n\n  while (currentIndex < text.length) {\n    let chunk = text.slice(currentIndex, currentIndex + maxLength);\n\n    // Evita cortar no meio de palavras\n    if (chunk.length === maxLength) {\n      const lastSpace = chunk.lastIndexOf(' ');\n      if (lastSpace > -1 && currentIndex + maxLength < text.length) {\n        chunk = chunk.slice(0, lastSpace);\n        currentIndex += lastSpace + 1;\n      } else {\n        currentIndex += maxLength;\n      }\n    } else {\n      currentIndex += maxLength;\n    }\n\n    result.push(chunk);\n  }\n\n  return result;\n}\n\nconst splitted = splitLongString(text, maxLength);\n\n// Retorna cada pedaço com índice começando em 1\nreturn splitted.map((part, index) => ({\n  json: {\n    trecho: part,\n    count: index + 1\n  }\n}));\n"},"type":"n8n-nodes-base.code","typeVersion":2,"position":[416,576],"id":"d5e61be5-018a-4a2b-90a6-ff39cca230a6","name":"Code1"},{"parameters":{"assignments":{"assignments":[{"id":"e9acfb83-848d-45e0-86cc-05b4a82dda36","name":"Resumo","value":"=SCRIPT DE APRESENTAÇÃO\n. INTRODUÇÃO (- minutos)\nAbertura:\n\"Bom dia/Boa tarde! Sou [nome] e hoje apresentarei nosso Trabalho de Conclusão de Curso\nsobre 'A Evolução do Marketing até a Era Digital e seu Impacto nas Mídias Sociais', utilizando\ncomo estudo de caso a Doceria Perdomo Doce.\"\nContextualização:\n\"Vivemos em uma era de transformações digitais aceleradas. O marketing, que antes se\nlimitava a anúncios em jornais e rádio, hoje se reinventou completamente. Nossa pesquisa\nbusca compreender essa evolução e demonstrar, através de um caso real, como pequenos\nnegócios podem se beneficiar dessas mudanças.\"\nObjetivos da Pesquisa:\n• Analisar a evolução histórica do marketing\n• Compreender o impacto das mídias sociais na comunicação empresarial\n• Demonstrar como pequenos negócios podem crescer na era digital\n• Apresentar estratégias práticas através do caso Perdomo Doce\nEstrutura da Apresentação:\n\"Nossa apresentação está dividida em quatro partes principais: a evolução histórica do\nmarketing, o papel das mídias sociais, o empreendedorismo digital e nosso estudo de caso\nprático.\"\n. EVOLUÇÃO DO MARKETING (- minutos)\nDas Origens à Revolução Industrial:\n\"O marketing sempre existiu nas relações humanas. Desde as antigas feiras e mercados, já\nhavia estratégias básicas para atrair consumidores. Como afirma Las Casas, 'o marketing\nsurgiu com o homem, no momento em que ele começou a realizar trocas'.\"\nA Grande Transformação:\n\"A Revolução Industrial marcou um ponto de virada. A produção em massa criou a\nnecessidade de estratégias mais sofisticadas para aproximar produtos dos consumidores.\nSurgiram os primeiros meios de comunicação de massa: rádio, televisão e jornais.\"\nCaracterísticas do Marketing Tradicional:\n• Comunicação unidirecional (empresa → consumidor)\n• Foco no produto, não no cliente\n• Altos custos de divulgação\n• Limitações geográficas\nA Revolução Digital:\n\"Com a popularização da internet nos anos  e o surgimento das mídias sociais nos anos\n, o marketing enfrentou sua maior revolução. A comunicação tornou-se bidirecional,\npermitindo interação direta entre marcas e consumidores.\"\nCitação de Kotler:\n\"Como destaca Philip Kotler: 'O Marketing passou de uma filosofia de fazer-e-vender,\nvoltada para o produto, para uma filosofia de sentir-e-responder, centrada no cliente'.\"\n. MÍDIAS SOCIAIS E SEU IMPACTO (- minutos)\nDefinição e Características:\n\"As mídias sociais são plataformas digitais que permitem a criação e compartilhamento de\nconteúdo pelos usuários. Diferente da comunicação tradicional centralizada, elas criam um\nambiente dinâmico e colaborativo.\"\nMudança no Poder:\n\"Segundo Torres, 'nas mídias sociais, o consumidor deixa de ser apenas receptor da\ncomunicação. Ele passa a produzir conteúdo, avaliar, comentar, criticar e influenciar outros\nconsumidores. O poder se desloca e se redistribui'.\"\nImpactos Positivos:\n• Democratização do acesso ao marketing\n• Comunicação direta e personalizada\n• Baixo custo de divulgação\n• Alcance global\n• Feedback em tempo real\nImpactos Negativos:\n• Propagação de fake news\n• Exposição a críticas públicas\n• Necessidade de monitoramento constante\n• Riscos à saúde mental dos usuários\nTransformação nas Empresas:\n\"As empresas precisaram se tornar mais humanas, transparentes e autênticas. Qualquer\nerro pode se tornar viral, impactando diretamente a reputação da marca.\"\n. EMPREENDEDORISMO NA ERA DIGITAL (- minutos)\nEmpreendedorismo Tradicional vs Digital:\nModelo Tradicional:\n• Necessidade de lojas físicas\n• Altos investimentos iniciais\n• Limitações geográficas\n• Processos mais lentos\nModelo Digital:\n• Possibilidade de começar com baixo investimento\n• Alcance global desde o início\n• Testes rápidos e adaptações ágeis\n• Interação constante com o público\nNovas Oportunidades:\n\"Como destaca Ries, 'o empreendedor moderno constrói negócios em ambientes de\nextrema incerteza, mas ao mesmo tempo com ferramentas poderosas que permitem\naprender com o cliente em tempo real e adaptar-se rapidamente'.\"\nDemocratização da Tecnologia:\n\"A tecnologia não é mais exclusividade dos ricos. O rápido avanço tecnológico tornou os\nrecursos mais acessíveis, permitindo que pequenos empreendedores compitam em\nigualdade com grandes empresas.\"\n. ESTUDO DE CASO: PERDOMO DOCE (- minutos)\nApresentação da Empresa:\n\"A Perdomo Doce, anteriormente conhecida como Mariana Perdomo Doceria, foi fundada\nem  por Mariana Perdomo, recém-formada em Gastronomia. A empresa tornou-se\nreferência no segmento de confeitaria em Goiás, expandindo para outras regiões do Brasil.\"\nOs Primeiros Passos:\n\"Mariana começou vendendo bolos de pote em feiras gastronômicas de Goiânia, usando a\ncozinha de casa como centro de produção. Em seu primeiro evento, vendeu todas as\nunidades preparadas, demonstrando a aceitação imediata do público.\"\nCrescimento e Inovação:\n• Abertura da primeira loja física no Setor Bueno, Goiânia\n• Expansão para Anápolis e Brasília\n• Lançamento de aplicativo próprio\n• Criação do primeiro drive-thru em\n• Implementação de serviços de delivery\nEstratégia Digital:\n\"A comunicação da empresa no Instagram baseia-se em afetividade, memória afetiva e\nexperiência do cliente. A marca conseguiu criar uma conexão emocional forte com seu\npúblico através de conteúdo autêntico e humanizado.\"\nA Crise de :\n\"Em , a empresa enfrentou uma grave crise quando um cliente faleceu após consumir\num produto da empresa. A marca foi envolvida em suspeitas de envenenamento,\nresultando em forte repercussão negativa nas redes sociais e imprensa.\"\nGestão da Crise:\n\"Mariana Perdomo respondeu com responsabilidade e transparência:\n• Recolheu voluntariamente os lotes suspeitos\n• Colaborou com as investigações policiais\n• Reforçou protocolos de segurança alimentar\n• Comunicou-se com clareza e empatia nas redes sociais\n• Após análises do Procon, não foram encontradas irregularidades\"\nSuperação e Aprendizado:\n\"Apesar de um prejuízo estimado em R$  mil, a empresária demonstrou resiliência e\ntransformou a crise em oportunidade. A nova estratégia de comunicação tornou-se mais\nhumanizada, incluindo bastidores da produção e lives com a fundadora.\"\nRebranding:\n\"Em , a empresa passou por um rebranding, alterando o nome para 'Perdomo Doces'. O\nobjetivo era desvincular a imagem da empresa exclusivamente da figura da fundadora,\nampliando o conceito da marca como um coletivo.\"\nResultados Atuais:\n• Diversificação do cardápio (bolos de pote, gelatos, tortas, produtos sem açúcar)\n• Preços entre R ,\n• Inauguração da Casa Perdomo em\n• Foco no marketing de experiência\n. CONCLUSÕES E CONSIDERAÇÕES FINAIS (- minutos)\nPrincipais Aprendizados:\n. Transformação do Marketing:\n\"O marketing evoluiu de uma simples ferramenta de vendas para uma estratégia de\nconexão e relacionamento. Na era digital, não basta ter um bom produto; é preciso criar\nexperiências significativas.\"\n. Poder das Mídias Sociais:\n\"As mídias sociais democratizaram o marketing, permitindo que pequenos negócios\nalcancem resultados expressivos sem os altos custos da mídia tradicional. Porém, exigem\nautenticidade e transparência constantes.\"\n. Importância da Gestão de Crise:\n\"O caso Perdomo Doce demonstra que crises podem ser transformadas em oportunidades\nquando gerenciadas com responsabilidade, transparência e comunicação eficaz.\"\n8, 00eR\n. Empreendedorismo Feminino:\n\"A trajetória de Mariana Perdomo evidencia a força do empreendedorismo feminino no\nBrasil e serve como inspiração para outras empresárias.\"\nReflexões Finais:\n\"Concluímos que, na atualidade, o sucesso empresarial depende da capacidade de criar\nconexões genuínas, gerar valor real e manter um diálogo constante com o público. As\nempresas que compreendem essa nova lógica e utilizam as mídias sociais de forma\ninteligente e ética têm maiores chances de crescer de forma sustentável.\"\nMensagem Final:\n\"O exemplo da Perdomo Doce mostra que, mesmo sendo uma pequena empresa, é possível\ncrescer e se destacar usando o marketing digital de forma inteligente. A criatividade,\ncoragem e boa comunicação são fundamentais para superar desafios e construir marcas\nsólidas na era digital.\"\n. AGRADECIMENTOS E PERGUNTAS (- minutos)\n\"Agradecemos à nossa orientadora, Professora Ariane Lima Ramos, pela orientação e apoio\ndurante todo o desenvolvimento deste trabalho. Agradecemos também à Escola do Futuro\nde Goiás pela oportunidade de realizar esta pesquisa.\"\n\"Estamos abertas para perguntas e discussões sobre nossa pesquisa.\"","type":"string"}]},"options":{}},"type":"n8n-nodes-base.set","typeVersion":3.4,"position":[208,576],"id":"b8c02bd0-31d9-4bf7-8b0d-a2e6431e60ed","name":"Edit Fields1"},{"parameters":{"options":{}},"type":"n8n-nodes-base.splitInBatches","typeVersion":3,"position":[624,576],"id":"186d6cf8-87dd-4559-94ab-19376d2fe9e4","name":"Loop Over Items1"},{"parameters":{"name":"=audio{{ $('Loop Over Items1').item.json.count }}.mp3","driveId":{"__rl":true,"mode":"list","value":"My Drive"},"folderId":{"__rl":true,"value":"1Usl7qSHdMFhXz27JaLAN1mIIib7uv4X2","mode":"list","cachedResultName":"Audios tcc","cachedResultUrl":"https://drive.google.com/drive/folders/1Usl7qSHdMFhXz27JaLAN1mIIib7uv4X2"},"options":{}},"type":"n8n-nodes-base.googleDrive","typeVersion":3,"position":[432,832],"id":"51b5c9f5-2a37-43fb-ba15-4598176c603f","name":"Upload file1","credentials":{"googleDriveOAuth2Api":{"id":"UMUzXd6peuAPf6IA","name":"Google Drive account"}}},{"parameters":{},"type":"n8n-nodes-base.manualTrigger","typeVersion":1,"position":[0,576],"id":"4ffa469c-ffc9-44c2-b54a-d01b60be4da8","name":"When clicking ‘Execute workflow’"}],"connections":{"Edit Fields":{"main":[[{"node":"Code","type":"main","index":0}]]},"Code":{"main":[[{"node":"Loop Over Items","type":"main","index":0}]]},"Loop Over Items":{"main":[[],[{"node":"Generate audio","type":"main","index":0}]]},"Generate audio":{"main":[[{"node":"Upload file","type":"main","index":0}]]},"Upload file":{"main":[[{"node":"Loop Over Items","type":"main","index":0}]]},"Generate audio1":{"main":[[{"node":"Upload file1","type":"main","index":0}]]},"Edit Fields1":{"main":[[{"node":"Code1","type":"main","index":0}]]},"Loop Over Items1":{"main":[[],[{"node":"Generate audio1","type":"main","index":0}]]},"Upload file1":{"main":[[{"node":"Loop Over Items1","type":"main","index":0}]]},"Code1":{"main":[[{"node":"Loop Over Items1","type":"main","index":0}]]},"When clicking ‘Execute workflow’":{"main":[[{"node":"Edit Fields","type":"main","index":0}]]}},"settings":{"executionOrder":"v1"},"staticData":null,"meta":{"templateCredsSetupCompleted":true},"pinData":{},"versionId":"bab89c01-11e2-4217-8df2-2c2a2f4820a6","triggerCount":0,"shared":[{"updatedAt":"2025-07-30T20:14:46.609Z","createdAt":"2025-07-30T20:14:46.609Z","role":"workflow:owner","workflowId":"Z4YVgig7SHgw5Mg3","projectId":"BlSED80HESP48veq"}],"tags":[]}